Infineon/illd_release_tc3x/src/BaseSw/Infra/Sfr/TC35x/Ifx_reg.h
/**
 * \File Ifx_reg.h
 * \brief
 * Version: TC35XA_UM_V2.0.0.R0
 * Specification: TC3xx User Manual V2.0.0
 * MAY BE CHANGED BY USER [yes/no]: No
 *
 *                                 IMPORTANT NOTICE
 *
 *
 * Infineon Technologies AG (Infineon) licenses this file to you under the
 * Infineon Automotive SW Lab License v2025-01 (IFASLL). You may not use
 * this file except in compliance with IFASLL.
 *
 * The full license text is contained in IFASLL202501.pdf delivered with this SW.
 * Unless required by applicable law or agreed to in writing, software distributed
 * under this license is distributed "AS IS" without any warranty or liability of any
 * kind and Infineon hereby expressly disclaims any warranties or representations,
 * whether express, implied, statutory or otherwise, including but not limited to
 * warranties of workmanship, merchantability, fitness for a particular purpose,
 * defects in the licensed items, or non-infringement of third parties'
 * intellectual property rights. See the full license text for the specific
 * language governing permissions and limitations under IFASLL.
 */


#ifndef IFX_REG_H
#define IFX_REG_H 1

#include "IfxAgbt_reg.h"
#include "IfxAsclin_reg.h"
#include "IfxCan_reg.h"
#include "IfxCbs_reg.h"
#include "IfxCcu6_reg.h"
#include "IfxConverter_reg.h"
#include "IfxCpu_reg.h"
#include "IfxDma_reg.h"
#include "IfxDmu_reg.h"
#include "IfxDom_reg.h"
#include "IfxEbcu_reg.h"
#include "IfxEmem_mpu_reg.h"
#include "IfxEmem_reg.h"
#include "IfxEray_reg.h"
#include "IfxEvadc_reg.h"
#include "IfxFce_reg.h"
#include "IfxFsi_reg.h"
#include "IfxGeth_reg.h"
#include "IfxGpt12_reg.h"
#include "IfxHspdm_reg.h"
#include "IfxI2c_reg.h"
#include "IfxInt_reg.h"
#include "IfxIom_reg.h"
#include "IfxLmu_reg.h"
#include "IfxMcdslight_reg.h"
#include "IfxMtu_reg.h"
#include "IfxPfi_reg.h"
#include "IfxPms_reg.h"
#include "IfxPmu_reg.h"
#include "IfxPort_reg.h"
#include "IfxQspi_reg.h"
#include "IfxRif_reg.h"
#include "IfxSbcu_reg.h"
#include "IfxScu_reg.h"
#include "IfxSmu_reg.h"
#include "IfxSpu_reg.h"
#include "IfxSpulckstp_reg.h"
#include "IfxSrc_reg.h"
#include "IfxStm_reg.h"

#endif /*IFX_REG_H*/
